app/views/questions/_question.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% if question.author_id.present? %>
        <%= link_to User.find(question.author_id).username, user_path(User.find(question.author_id))%>