app/controllers/questions_controller.rb

INSERT INTO "questions" ("text", "created_at", "updated_at", "user_id", "author_id") VALUES (?, ?, ?, ?, ?)  [["text", "8888"], ["created_at", "2020-04-05 18:42:29.128766"], ["updated_at", "2020-04-05 18:42:29.128766"], ["user_id", 1], ["author_id", 1]]
---
  def create
    @question = Question.new(question_params)
    @question.asking_id = session[:user_id]
    if @question.save

UPDATE "questions" SET "answer" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["answer", "ccxz"], ["updated_at", "2020-04-05 19:05:01.112352"], ["id", 2]]
---
  def update
    if @question.update(question_params)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def load_question
    @question = Question.find(params[:id])