app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    redirect_to root_url, alert: 'Вы уже залогинены' if current_user.present?
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "username", "created_at", "updated_at", "email", "password_hash", "password_salt") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @user = load_user
    @questions = @user.questions.order(created_at: :desc)
    count = @questions.count
    plural = Russian.p(count, "вопрос", "вопроса", "вопросов")
    @string = "у этого пользователя #{count} #{plural}"
    @new_question = @user.questions.build
    @questions_count = @questions.count
    @answers_count = @questions.where.not(answer: nil).count
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ? ORDER BY "questions"."created_at" DESC  [["user_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ? AND "questions"."answer" IS NOT NULL  [["user_id", 1]]

  def load_user
    @user ||= User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]